/*	Scanner, String, Calendar, Wrapper 클래스 종합
Q)	본인의 생년월일을 이용하여 오늘 날짜를 기준으로 한국식 나이와 만 나이를 확인해보자.
	먼저 생년월일과 오늘날짜를 아래화면처럼 출력하는데, 
	생년월일은 사용자로부터 입력을 받고
	오늘날짜는 자바의 API클래스를 이용하여 받아온다.
	
	다음으로 한국식 나이와 만 나이를 계산하여 출력해보고,
	2023년 6월 28일부터 한국에서 나이 계산이 만 나이로만 통일될 예정이므로
	정책이 적용되는 6월 28일 당일의 본인 나이도 출력해보자. //네이버 계산기 있음
 	
	↓ Console ↓	
	생년월일을 입력하시오(@@@@-@@-@@): 1993-05-16
	생년월일: 1993년 5월 16일 
	오늘날짜: 2023년 2월 24일 
	=======나이 계산=======
	한국식 나이: 30세
	오늘날짜 만 나이: 29세
	6월 28일 통일 나이: 30세

*/
package contents;

public class Practice {

}
